//******************************************************************************
//
// Simple Base Library / YNConfFile
//
// 設定ファイルクラス
//
// Copyright (C) 2010 WADA Masashi. All Rights Reserved.
//
//******************************************************************************

// MEMO:
// INIファイルへのアクセスをラップするクラス。

#import "YNINIFile.h"


//******************************************************************************
// 設定ファイルクラス
//******************************************************************************
@interface YNConfFile : YNINIFile
{
}

@end


